In [23]:
import pandas as pd

s = pd.Series({"서울": 9904312, "부산": 3448737, "인천": 2890451, "대구": 2466052},
              index=['대구','인천','부산','서울'])

s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158},
              index=['대전','인천','부산','서울'])
s2

대전    1490158
인천    2632035
부산    3393191
서울    9631482
dtype: int64

In [11]:
s2 - s

대전   -975894
인천   -258416
부산    -55546
서울   -272830
dtype: int64

In [20]:
# NaN (Not a Number의 약자임) = float타입임
for k, v in s2.items(): # dict와 유사하게 사용이 가능함
    print(k, v)

대전 1490158
인천 2632035
부산 3393191
서울 9631482

In [24]:
s

대구    2466052
인천    2890451
부산    3448737
서울    9904312
dtype: int64

In [22]:
s2

대전    1490158
인천    2632035
부산    3393191
서울    9631482
dtype: int64

In [34]:
# 서울 부산 인천 도시에 대한인구 감소율(%) 출력
# 출력 결과
# 부산    1.636984
# 서울    2.832690
# 인천    9.818107
# dtype: float64
((s-s2)/s2*100)[2:]

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [32]:
ds2 = (s - s2)/s2*100
ds2[ds2.notnull()]

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [36]:
rs=(s-s2)/s2*100
rs=rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [37]:
rs['서울']

2.832689714833086

In [ ]:
del rs['서울'] # 삭제가능
rs

In [40]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [45]:
print(obj.array)
print(obj.index)

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64
RangeIndex(start=0, stop=4, step=1)

In [48]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2.sort_index()

a   -5
b    7
c    3
d    4
dtype: int64

In [52]:
# d의 값을 6으로 변경하기
obj2['d'] = 6
obj2

d    6
b    7
a   -5
c    3
4    6
dtype: int64

In [53]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [56]:
# 양수보다 큰 데이터만 출력
obj2[obj2>0]

d    6
b    7
c    3
4    6
dtype: int64

In [60]:
print(6 in obj2) # index를 검색하는 것임
print('b' in obj2)

False
True

In [61]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [63]:
obj3 = pd.Series(sdata) # dict에서 시리즈화
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [64]:
obj3.to_dict() # dict로 변환도 가능함

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [68]:
pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [69]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [79]:
# is,not , na,null
obj4.notnull()
obj4.notna()
pd.notnull(obj4)
pd.notna(obj4)
obj4.isnull()
obj4.isna()
pd.isnull(obj4)
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [81]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [83]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [82]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [86]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [87]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [88]:
pd.Series(data)

state    [Ohio, Ohio, Ohio, Nevada, Nevada, Nevada]
year           [2000, 2001, 2002, 2001, 2002, 2003]
pop                  [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
dtype: object

In [ ]:
# data2 = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
#         "year": [2000, 2001, 2002, 2001, 2002, 2003],
#         "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
# pd.DataFrame(data2)

In [91]:
frame = pd.DataFrame(data) # 시리즈 데이터와 데이터프레임의 차이
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [92]:
frame.head()
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [96]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [97]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [99]:
frame2.index

RangeIndex(start=0, stop=6, step=1)

In [101]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [105]:
frame2['state']
frame2.state # 위와 동일한 결과가 나옴

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [108]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [109]:
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [110]:
# iloc : 고유의 행 인덱스 번호를 지정하여 자료를 참조
# loc : 행 인덱스 라벨을 지정하여 자료를 참조
# iloc : frame2를 출력했을 때 눈에 보이는 행 인덱스 라벨을 지정하여 참조 ex)df.head의 마지막 행 => df.iloc[-1]
# loc : frame2를 출력했을 때 눈에 안 보이는 고유의 인덱스 번호를 행 인덱스 라벨이라고 함 => df.loc[-1] 이것이 안됨; 실제 행에 -1인덱스 행이 없기 때문임

In [111]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [115]:
# s.iloc['서울'] 이렇게 하면 인덱스 번호를 지정한 것이 아니므로 안됨
s.loc['서울'] # 존재하는 인덱스명이므로 지정이 가능함

9904312

In [119]:
print(type(frame2))
print(type(frame2['debt']))  # 하나의 행이나 열을 추출하면 그 데이터는 시리즈 데이터로 변환됨
frame2['debt']
# 즉 시리즈들이 모이면 데이터프레임이 되고 하나를 추출하면 시리즈가 됨

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
Name: debt, dtype: object

In [124]:
import numpy as np

frame2["debt"] = np.arange(6.) # 특정 데이터로 초기화, arange(6.)으로 했으므로 실수로 데이터를 입력함
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [125]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [126]:
frame2['debt'] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [130]:
# eastern 열을 생성하고 데이터를 True, True, True, False, False, False 를 담기 
frame2['eastern'] = [True, True, True, False, False, False]
frame2
frame2['eastern'] = frame2['state'] == 'Ohio' # 이렇게도 만들 수 있음
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [131]:
del frame2["eastern"]

In [138]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

pd.DataFrame(populations)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [218]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9, 2003: 3.1}}
frame3 = pd.DataFrame(populations)
frame3
# 입력이 안된 값은 NaN으로 표시됨

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [143]:
frame3.T # transpose 작업한 것을 전치행렬이라고 함. numpy에서 사용했던 T와 같음

        2000  2001  2002  2003
Ohio     1.5   1.7   3.6   NaN
Nevada   NaN   2.4   2.9   3.1

In [146]:
pd.DataFrame(populations, index=[2001, 2002, 2004])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2004   NaN     NaN

In [181]:
# 아래와 같이 출력되도록 만들기
# 2000    1.5
# 2001    1.7
frame3['Ohio'].head(2)
frame3['Ohio'][:2]
frame3['Ohio'][:-2]
frame3['Ohio'].iloc[:2]
frame3['Ohio'].iloc[[0,1,]]
frame3['Ohio'].loc[2000:2001]
frame3['Ohio'].loc[[2000,2001]]
# 위같이 다양한 추출 방법이 있음

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [180]:
frame3['Nevada'][:-2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [184]:
# 시리즈 데이터를 합치는 방법은 다양한데 아래와 같은 방법이 있음
pd.DataFrame({
    'Ohio': frame3['Ohio'][:-2],
    'Nevada': frame3['Nevada'][:-2]
})

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [191]:
# 현재는 둘다 출력이 안될 것임
print(frame3.index.name)
print(frame3.columns.name)

None
None

In [192]:
# 정보가 없는 상태이므로 입력해줌
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [194]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9
2003    NaN     3.1

In [200]:
# numpy형식으로 변경
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9],
       [nan, 3.1]])

In [201]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [202]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [206]:
index=obj.index
index[1:]

Index(['b', 'c'], dtype='object')

In [214]:
obj2 = pd.Series([1.5, -2.5, 0], index=np.arange(1,4))

In [217]:
# 4가 인덱스 중에 있는가?
4 in obj2.index

False

In [221]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [220]:
2024 in frame3.index
'Utah' in frame3.columns

False

In [224]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj2 = obj.reindex(["a", "b", "c", "d", "e"]) # 인덱스를 새로 설정
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [226]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [231]:
obj3.reindex(np.arange(6)) # 중간에 없던 인덱스까지 생성하며 생성된 인덱스의 데이터는 NaN값으로 처리됨

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [233]:
obj3.reindex(np.arange(6), method='ffill') # ffill = forward fill의 약자로 앞의 데이터로 채우는 기능

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [242]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [243]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [245]:
states = ["Texas", "Utah", "California"]
frame2 = frame.reindex(columns=states) # 컬럼 변경 및 데이터를 컬럼에 맞도록 변경
# frame2.columns = states # 컬럼명'만' 변경
frame2

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [247]:
frame.loc[['a','d','c']]

   Ohio  Texas  California
a     0      1           2
d     6      7           8
c     3      4           5

In [251]:
frame.loc[['a','d','c'], 'California']
frame.loc[['a','d','c'], ['California', 'Texas']]

   California  Texas
a           2      1
d           8      7
c           5      4

In [252]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [253]:
new_obj = obj.drop('c') # c행 삭제
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [255]:
obj.drop(['d','c']) # 여러개를 삭제할 때도 리스트 구조로 담으면 삭제가능

a    0.0
b    1.0
e    4.0
dtype: float64

In [256]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [259]:
data2 = data.drop(['Colorado', 'Ohio'])
data2

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [262]:
data3 = data.drop(['two'], axis=1) # 열을 삭제할 땐 axis=1까지 입력하면 됨
data4 = data.drop(columns=['two']) # 아니면 컬럼이라고 지정해주면 이름을 찾을 수 있음
data5 = data.drop('two', axis='columns') # axis에 columns라고 명시하는 방법도 있음
# 변수에 담지 않고 바로 적용하고 싶으면 inplace = True로 적용하면 바로 변수에 적용할 수 있음
data5

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [263]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [267]:
obj[1] # 권장하지 않는 표기법임. 전에 확인했듯 iloc를 사용하는 것을 권장
obj.iloc[[1,3]]
# obj에서 2보다 작은 것만 출력
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [269]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])
obj1

2    1
0    2
1    3
dtype: int64

In [270]:
obj2

a    1
b    2
c    3
dtype: int64

In [275]:
obj1.iloc[:3]
obj1.loc[[2,0,1]] # 위와 동일한 결과를 출력함

2    1
0    2
1    3
dtype: int64

In [276]:
obj2.loc['b':'c'] = 10
obj2

a     1
b    10
c    10
dtype: int64

In [277]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [278]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [279]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [280]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [285]:
# three열 값이 5보다 큰 자료를 추출
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [302]:
# data에서 5,6을 추출
data.iloc[1,[1,2]]
data.loc['Colorado'][1:3]

two      5
three    6
Name: Colorado, dtype: int32

In [314]:
data.iloc[[1,2], 3] # 행과 열을 입력하는 구간에 동시에 대괄호를 사용하면 데이터프레임으로 적용됨

          four
Colorado     7
Utah        11

In [303]:
data.iloc[2]
data.iloc[2,3]
data.iloc[2,[3,0]]
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [323]:
# utah까지만 추출해보기. 뉴욕은 제외
data.iloc[[0,1,2]]
data.iloc[:3]
data[:3]
data.loc['Ohio':'Utah']
data.loc[:'Utah'] # 이게 되네;;

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [327]:
# 이전의 결과에서 two열만 나오도록 만들기
data.loc['Ohio':'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [330]:
data.iloc[:, :3]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [334]:
data.loc['Ohio'] # 행 지정

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [335]:
data.three # 열 지정

Ohio         2
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [336]:
data[data.three > 5] # three 값이 5보다 큰 것만 추출함

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [337]:
# 연습문제

In [343]:
# 1.
import pandas as pd
import numpy as np
# (1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.
nums1 = np.random.randint(1, 101, 3)
nums2 = np.random.randint(1, 101, 3)

s1 = pd.Series(nums1, index=['a', 'b', 'c'])
s2 = pd.Series(nums2, index=['a', 'b', 'd'])
print(s1)
print(s2)
# (2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.
print()
print(s1 + s2)
print()
print(s1 - s2)
print()
print(s1 * s2)
print()
print(s1 / s2)

a     3
b    87
c    17
dtype: int32
a    34
b    12
d    49
dtype: int32

a    37.0
b    99.0
c     NaN
d     NaN
dtype: float64

a   -31.0
b    75.0
c     NaN
d     NaN
dtype: float64

a     102.0
b    1044.0
c       NaN
d       NaN
dtype: float64

a    0.088235
b    7.250000
c         NaN
d         NaN
dtype: float64

In [353]:
# 2. 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
# (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
# (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.
data = {"year": [2000, 2001, 2002, 2001, 2002, 2003],
        "height": [162, 175, 180, 190, 185, 170],
        "weight": [60.4, 70.5, 80.0, 90.1, 65.8, 75.4],
        'region': ['서울', '인천', '대구', '서울', '인천', '대구'],
        'eyes': [1.0, 1.5, 0.5, 0.6, 0.9, 0.1]
        }
df = pd.DataFrame(data2).T
df

           0     1     2     3     4     5
year    2000  2001  2002  2001  2002  2003
height   162   175   180   190   185   170
weight  60.4  70.5  80.0  90.1  65.8  75.4
region    서울    인천    대구    서울    인천    대구
eyes     1.0   1.5   0.5   0.6   0.9   0.1

In [398]:
# 3. 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.
# data = {
#     "국어": [80, 90, 70, 30],
#     "영어": [90, 70, 60, 40],
#     "수학": [90, 60, 80, 70],
# }
# columns = ["국어", "영어", "수학"]
# index = ["춘향", "몽룡", "향단", "방자"]
# df = pd.DataFrame(data, index=index, columns=columns)
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
print(type(df.수학), df.수학)
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
print(type(df.iloc[:,:2]), df.iloc[:,:2])
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
lst = [np.mean(df.iloc[i]) for i in range(len(df))]
df['평균점수'] = lst
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df.loc['방자', '영어'] = 80
df.loc['방자', '평균점수'] = np.mean(df.loc['방자'])
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
print(type(df.loc[['춘향']]), df.loc[['춘향']])
# (6) 향단의 점수를 시리즈로 나타낸다.
print(type(df.loc['향단']), df.loc['향단'])

<class 'pandas.core.series.Series'> 춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64
<class 'pandas.core.frame.DataFrame'>     국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40
<class 'pandas.core.frame.DataFrame'>     국어  영어  수학       평균점수
춘향  80  90  90  86.666667

(pandas.core.series.Series,
 국어      70.0
 영어      60.0
 수학      80.0
 평균점수    70.0
 Name: 향단, dtype: float64)